.specmgr/feat/feat-4-qwen3.8-27b-dell-7960t/bin/baselines/2026-08-25-task-4.1-bench-nvfp4-896k.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7217539a11c0>, trust_remote_code=False, seed=0, num_prompts=2, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=890000, random_output_len=100, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://localhost:8005', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='qwen3.8-27b-nvfp4-896k-diag', input_len=None, output_len=None, tokenizer='/data/nvidia/hf_cache/hub/models--unsloth--Qwen3.8-27B-NVFP4/snapshots/7d6f8d4d72f56b92b3cdbf22f156b90e1bab0108', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-73c9467d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-25 17:19:31 [utils.py:90] Sampling input_len from [890000, 890000] and output_len from [100, 100]
[transformers] Token indices sequence length is longer than the specified maximum sequence length for this model (959219 > 262144). Running this sequence through the model will result in indexing errors
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
100%|██████████| 2/2 [18:13<00:00, 546.62s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     2         
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  1093.24   
Total input tokens:                      1780000   
Total generated tokens:                  200       
Request throughput (req/s):              0.00      
Output token throughput (tok/s):         0.18      
Peak output token throughput (tok/s):    50.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1628.37   
---------------Time to First Token----------------
Mean TTFT (ms):                          819147.85 
Median TTFT (ms):                        819147.85 
P99 TTFT (ms):                           1086111.04
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2335.38   
Median TPOT (ms):                        2335.38   
P99 TPOT (ms):                           4607.56   
---------------Inter-token Latency----------------
Mean ITL (ms):                           2526.80   
Median ITL (ms):                         1318.28   
P99 ITL (ms):                            8430.46   
==================================================